#+title: A Sample-Synchronous Distributed Audio System for Spatial and Immersive Applications
#+author: Thomas Albert Rushton

#+options: toc:nil num:4 h:4
#+export_file_name: out/thesis
#+latex_class: thesis
#+cite_export: biblatex
#+latex_header_extra: \RequirePackage[]{./out/thesis}

#+include: "frontmatter.tex" src latex

** Configuring the iMXRT1062 MCU

Before proceeding to a discussion of /time exchange/ mechanisms, it is
important to deal with how audio timing is configured on our target
hardware platform, the Teensy 4.1 and its NXP iMXRT1062 MCU.

The iMXRT1062 features a dedicated audio phase locked loop (PLL),
PLL4, and a /synchronous audio interface/, SAI1, the latter providing
I^{2}S output. By convention, the output frequency produced by SAI1,
~SAI1_CLK_ROOT~, \(f_{R}\), must be 256 times oversampled with respect
to the target audio sampling rate, \(f_{s}\):

#+NAME: eq:sai1-1
\begin{equation}
f_{R} = 2^{8}f_{s}\;.
\end{equation}

The NXP MCUXpresso Config Tools software\nbsp[cite:@MCUXpresso2018]
indicates that \(f_{R}\) must be lower than or equal to
\qty{66}{\MHz}, therefore

#+begin_src emacs-lisp :exports none
(format "Fs <= %f Hz" (/ 66e6 (lsh 1 8)))
#+end_src

#+RESULTS:
: Fs <= 257812.500000 Hz

#+NAME: eq:max-fs
\begin{equation}
f_{s} \leq 257\,812.5\;\text{Hz}\;.
\end{equation}
\(f_{R}\) is found by dividing the frequency of ~PLL4_MAIN_CLK~,
\(f_{M}\), by the ~SAI1_CLK_PRED~, \(D_{I_{1}}\), and ~SAI1_CLK_PODF~,
\(D_{I_{2}}\) fields of the ~CCM_CS1CDR~ register:

#+NAME: eq:sai1-2
\begin{equation}
f_{R} = \frac{f_{M}}{D_{I_{1}}D_{I_{2}}}\;.
\end{equation}
\(f_{M}\) is found by dividing \(f_{P}\), the frequency of PLL4, by
the ~POST_DIV_SELECT~, \(D_{p}\), and ~AUDIO_DIV~, \(D_{A}\) registers:

#+NAME: eq:pll4-main
\begin{equation}
f_{M} = \frac{f_{P}}{D_{p}D_{A}}\;.
\end{equation}
\(f_{P}\) is the result of multiplying the iMXRT1062's \qty{24}{\MHz}
clock source, \(f_{XO}\), by the PLL4 divider, \(D_{P}\):

#+NAME: eq:pll4
\begin{equation}
f_{P} = f_{XO}D_{P}\;,
\end{equation}
and \(D_{P}\) is, in turn, the sum of the /PLL loop divider/, the
~DIV_SELECT~ field of the ~CCM_ANALOG_PLL~ ~_AUDIO~ register, \(D_{S}\), with
the quotient of ~CCM_ANALOG_PLL_AUDIO_NUM~, \(D_{N}\), the /PLL
fractional loop divider/ numerator register and
~CCM_ANALOG_PLL_AUDIO_DENOM~, \(D_{D}\), the denominator register:

#+NAME: eq:pll4-divider
\begin{equation}
D_{P} = D_{S} + \frac{D_{N}}{D_{D}}\;.
\end{equation}

The ~DIV_SELECT~ field has a valid range of \(27 \leq D_{S} \leq 54\),
and \(|D_{N}| < D_{D}\), so \(D_{P}\) describes (in theory) a number in the
following range:

#+NAME: eq:
\begin{equation}
\left(26 + \frac{1}{D_{D}}\right) \leq D_{P} \leq \left(54 + \frac{D_{D}-1}{D_{D}}\right)\;,
\end{equation}
with \(1 \leq D_{D} \leq 2^{30}\); effectively, \(26 < D_{P} <
55\). MCUXpresso Config Tools, and the iMXRT1062 reference
manual\nbsp[cite:@nxpsemiconductorsIMX2021] (see §13.3.2.2 and
§14.6.1.3.4), indicate, however, that the output frequency range for
PLL4 is:

#+NAME: eq:pll4-range
\begin{equation}
650\,\text{MHz} \leq f_{P} \leq 1\,300\,\text{MHz}\;,
\end{equation}
plus Config Tools contradicts the reference manual and states that
\(D_{N}\) must be a /positive/ 30 bit integer, so:

#+begin_src emacs-lisp :exports none
(let ((DpMin (/ 650e6 24e6))
      (DpMax (/ 1300e6 24e6)))
  (format "%f <= PLL4 divider <= %f" DpMin DpMax))
#+end_src

#+RESULTS:
: 27.083333 <= PLL4 divider <= 54.166667

#+NAME: eq:
\begin{equation}
\left(27 + \frac{1}{12}\right) \leq D_{P} \leq \left(54 + \frac{1}{6}\right).
\end{equation}
Setting extreme (but valid) values for the divisors, we can find the
minimal valid \(f_{s}\):

#+begin_src emacs-lisp :exports none
(let* ((postDivSelect 4)
       (audioDiv 4)
       (pll4Div (* postDivSelect audioDiv))
       (sai1ClkPred 8)
       (sai1ClkPodf 64)
       (sai1Div (* sai1ClkPred sai1ClkPodf))
       (DpMin (/ 650e6 24e6))
       (fsMin (/ (* 24e6 DpMin) (* pll4Div sai1Div (lsh 1 8))))
       (fsMax (/ 66e6 (lsh 1 8))))
  (format "%f Hz <= Fs <= %f Hz" fsMin fsMax))
#+end_src

#+RESULTS:
: 309.944153 Hz <= Fs <= 257812.500000 Hz

#+NAME: eq:fs-range
\begin{equation}
309.9\;\text{Hz} \leq f_{s} \leq 257\,812.5\;\text{Hz}\;.
\end{equation}

** Media Clock Recovery

Time exchange at the level of the ethernet subsystems of distributed
modules does not directly help us achieve audio sampling rate
parity. The time exchange information derived from PTP must be used to
condition the audio clocks of the modules such that sampling rate
parity is achieved; this is a process referred to as /media clock
recovery/\nbsp[cite:@crankshawMedia2021].

In the case of the iMXRT1062 MCU this process is achieved by using the
nanoseconds-per-second PTP-derived adjustment value at second \(n\),
\(a_{n}\), to adjust the sampling rate. For a nominal sampling rate
\(f_{s}\) (e.g. \qty{48}{\kHz}), the sampling rate, \(\hat{f}_{s,n}\) that
"matches" that of the time authority is found simply as

#+NAME: eq:sampling-rate-recovery-1
\begin{equation}
\hat{f}_{s,n} = f_{s}(1 + a_{n})\;.
\end{equation}
For example, if \(a_{n} = -1750\;\text{ns}\), we have

#+begin_src emacs-lisp :exports none
(let* ((fs 48000)
       (a -1750e-9)
       (proportion (+ 1 a))
       (fhats (* fs proportion)))
  (format "%.9f %f" proportion fhats))
#+end_src

#+RESULTS:
: 0.999998250 47999.916000

#+NAME: eq:
\begin{align*}
\hat{f}_{s,n} &= f_{s}(1 - 1750 \times 10^{-9}) \\
  &= 48\,000 \times 0.999\,998\,25 \\
  &= 47\,999.916\;\text{Hz}\;.
\end{align*}
Inserting this value into the expression for the audio sampling rate
of the iMXRT1062 yields

#+NAME: eq:
\begin{equation}
47\,999.916 = \frac{24 \times 10^{6}}{2^{8}}\frac{D_{S} + \frac{D_{N,n}}{D_{D}}}{D_{p}D_{A}D_{I_{1}}D_{I_{2}}}\;,
\end{equation}
and rearranging to find the appropriate value for the PLL4 numerator
register

#+NAME: eq:
\begin{equation}
D_{N,n} = D_{D}\left(\frac{2^{8} \times 47\,999.916 \times D_{p}D_{A}D_{I_{1}}D_{I_{2}}}{24 \times 10^{6}} - D_{S}\right)
\end{equation}

In practice cref:eq:sampling-rate-recovery-1 does not suffice,
however, and some residual parts per billion drift remains (see cref:fig:drift).

